Part 1: This untidy data has the test scores for the students.
    This data shows the scores for 5 students for 1st exam for each term in 3 differnt terms.

In [4]:
import pandas as pd
#read in untidy data csv as a pandas dataframe object
student_testing_df = pd.read_csv('/Users/aliahsansumon/Desktop/Project 2 IS-362/Test scores.csv')

#read first 5 rows to check that dataframe was created
student_testing_df.head()

   ID    Name  Phone Sex and age  test number  term 1  term 2  term3
0   1   Emily    110        F_14            1      90      95     90
1   2   Sarah    718        F_12            1      80      75     94
2   3    John    646        M_10            1      70      80     92
3   4  Hannah    200        F_13            1      80      90     80
4   5     Ali    917        M_12            1      85      90     95

# This data for the students and thier test scores is very untidy, because it shows ID numbers and the names, plus 
their phone numbers in different columns and sex and age which is very unclear and confusing to interpret.
So we have to tidy the data in a way that is is clear the gender of the student next to their name and their 
test scores.

In [5]:
#split the dataframe into two separate tables, one for students and one for the grades
students_df = student_testing_df[['ID', 'Name', 'Phone', 'Sex and age']].copy() # make a copy to avoid warning
test_grades_df = student_testing_df[['ID', 'test number', 'term 1', 'term 2', 'term3']]

# Split single column into two columns
students_df[['Sex', 'Age']] = students_df['Sex and age'].str.split("_", expand=True)

# modify original dataframe using .loc accessor
students_df.loc[:, ['Sex', 'Age']] = students_df[['Sex', 'Age']]

# drop the original 'sex and age' column
students_df.drop('Sex and age', axis=1, inplace=True)

#Check the dataframe
students_df.head()

   ID    Name  Phone Sex Age
0   1   Emily    110   F  14
1   2   Sarah    718   F  12
2   3    John    646   M  10
3   4  Hannah    200   F  13
4   5     Ali    917   M  12

In [6]:
# The dataframe for the test dataframe is not very large, we can print the whole thing to see the data
print(test_grades_df)

   ID  test number  term 1  term 2  term3
0   1            1      90      95     90
1   2            1      80      75     94
2   3            1      70      80     92
3   4            1      80      90     80
4   5            1      85      90     95

In [7]:
tidy_grades_df = test_grades_df.melt(id_vars = ['ID', 'test number'], value_vars = ['term 1', 'term 2', 'term3'], 
                                     var_name ='term', value_name ='score')

In [8]:
#now we have a long format dataframe for test grades:
print(tidy_grades_df)

    ID  test number    term  score
0    1            1  term 1     90
1    2            1  term 1     80
2    3            1  term 1     70
3    4            1  term 1     80
4    5            1  term 1     85
5    1            1  term 2     95
6    2            1  term 2     75
7    3            1  term 2     80
8    4            1  term 2     90
9    5            1  term 2     90
10   1            1   term3     90
11   2            1   term3     94
12   3            1   term3     92
13   4            1   term3     80
14   5            1   term3     95

Now the data is tidy and it shows the scores for the students.

# Population Data for the 4 countries U.S, China, Bangladesh and Russia for the years 2,000, 2010, 2020.

In [9]:
#read in untidy data csv as a pandas dataframe object
populations_df = pd.read_csv('/Users/aliahsansumon/Desktop/Project 2 IS-362/population.csv')

populations_df.head()

         Country           2000           2010           2020
0  United States    282,200,000    309,300,000    329,500,000
1          China  1,263,000,000  1,338,000,000  1,411,000,000
2     Bangladesh    129,193,327    148,391,139    167,420,951
3         Russia    146,600,000    142,800,000    144,100,000

Now I have to tidy the data so that the countries and years and populations are on separate columns.

In [11]:
tidy_populations_df = populations_df.melt(id_vars ='Country', var_name ='Year', value_name ='Population')

tidy_populations_df.head()

         Country  Year     Population
0  United States  2000    282,200,000
1          China  2000  1,263,000,000
2     Bangladesh  2000    129,193,327
3         Russia  2000    146,600,000
4  United States  2010    309,300,000

In conclusion, I have learned how to tidy some untidy data sets.